# Create Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
Material..::..Create Method
Material Class Example See Also
---
Creates a new material.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public static ElementId Create(
	Document document,
	string name
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	document As Document, _
	name As String _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ Create(
	Document^ document,
	String^ name
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document in which to create the material.
name
    Type: System..::..String The name of the new material.
# ### Return Value
Identifier of the new material.
# Examples
CopyC#
```text
//Create the material
ElementId materialId = Material.Create(document, "My Material");
Material material = document.GetElement(materialId) as Material;

//Create a new property set that can be used by this material
StructuralAsset strucAsset = new StructuralAsset("My Property Set", StructuralAssetClass.Concrete);
strucAsset.Behavior = StructuralBehavior.Isotropic;
strucAsset.Density = 232.0;

//Assign the property set to the material.
PropertySetElement pse = PropertySetElement.Create(document, strucAsset);
material.SetMaterialAspectByPropertySet(MaterialAspect.Structural, pse.Id);
```

CopyVB.NET
```text
'Create the material
Dim materialId As ElementId = Material.Create(document, "My Material")
Dim material__1 As Material = TryCast(document.GetElement(materialId), Material)

'Create a new property set that can be used by this material
Dim strucAsset As New StructuralAsset("My Property Set", StructuralAssetClass.Concrete)
strucAsset.Behavior = StructuralBehavior.Isotropic
strucAsset.Density = 232.0

'Assign the property set to the material.
Dim pse As PropertySetElement = PropertySetElement.Create(document, strucAsset)
material__1.SetMaterialAspectByPropertySet(MaterialAspect.Structural, pse.Id)
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | name cannot include prohibited characters. -or- The given value for name is already in use as a material element name. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Material Class
Autodesk.Revit.DB Namespace